package ru.progwards.java1.lessons.arrays;

public class ArraySort {
    public static void sort(int[] a){
        int z = 0;
//        1. Берем первый элемент и сравниваем его со вторым, если второй меньше, меняем элементы в массиве местами.
//        2. Далее, сравниваем первый элемент с третьим, и если третий меньше, меняем их местами.
//        3. Так делаем для всех элементов с индексом больше первого
//        4. Берем второй элемент и сравниваем его с третьим, если нужно, меняем местам
//        5. Далее сравниваем второй элемент с четвертым, и если нужно, меняем местами.
//        6. Делаем так для всех элементов, с индексом больше 2-го
//        7. Переходим к элементу с индексом 3...
//        8. Обобщая, алгоритм звучит следующим образом - сделать 2 вложенных цикла, внешний по i и внутренний по j.
//        Внутренний цикл начинается от i+1, и если a[i] > a[j], то нужно поменять элементы a[i] и a[j] местами.
        for(int i = 0; i < a.length; i++){
            for (int j = i + 1; j < a.length; j++){
                if (a[i] > a[j]){
                    z = a[i];
                    a[i] = a[j];
                    a[j] = z;
                }
            }
        }
    }

//    public static void main(String[] args) {
//        int [] b = {12, 3, 0, 7, 8, 333, 45};
//        System.out.println(Arrays.toString(b));
//        sort(b);
//        System.out.println(Arrays.toString(b));
//    }
}
